# task1
# Найдите сумму цифр трехзначного числа.
# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

# print('введите трехзначное число')

a = '123'

print(int(a[0]) + int(a[1]) + int(a[2]))                           #int(a[0] + a[1] + a[2]))