# task1
# Найдите сумму цифр трехзначного числа.
# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

# print('введите трехзначное число')

a = '123'
sum = int(a[0] + a[1] + a[2])
print(sum)                           #int(a[0] + a[1] + a[2]))